# Before your start:
- Read the README.md file
- Comment as much as you can and use the resources (README.md file)
- Happy learning!

In [16]:
pip install pandas

Requirement already satisfied: pandas in c:\users\administrator\anaconda3\envs\test\lib\site-packages (2.1.1)
Requirement already satisfied: numpy>=1.23.2 in c:\users\administrator\anaconda3\envs\test\lib\site-packages (from pandas) (1.26.1)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\administrator\appdata\roaming\python\python311\site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in c:\users\administrator\anaconda3\envs\test\lib\site-packages (from pandas) (2023.3.post1)
Requirement already satisfied: tzdata>=2022.1 in c:\users\administrator\anaconda3\envs\test\lib\site-packages (from pandas) (2023.3)
Requirement already satisfied: six>=1.5 in c:\users\administrator\appdata\roaming\python\python311\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)
Note: you may need to restart the kernel to use updated packages.

In [17]:
# import numpy and pandas
import pandas as pd
import numpy as np

# Challenge 1 - Exploring the Data

In this challenge, we will examine all salaries of employees of the City of Chicago. We will start by loading the dataset and examining its contents.

In [18]:
salaries = pd.read_csv('Current_Employee_Names__Salaries__and_Position_Titles.csv')

Examine the `salaries` dataset using the `head` function below.

In [19]:
salaries.head()

,Name,Job Titles,Department,Full or Part-Time,Salary or Hourly,Typical Hours,Annual Salary,Hourly Rate
0,"AARON, JEFFERY M",SERGEANT,POLICE,F,Salary,NaN,101442.0,NaN
1,"AARON, KARINA",POLICE OFFICER (ASSIGNED AS DETECTIVE),POLICE,F,Salary,NaN,94122.0,NaN
2,"AARON, KIMBERLEI R",CHIEF CONTRACT EXPEDITER,GENERAL SERVICES,F,Salary,NaN,101592.0,NaN
3,"ABAD JR, VICENTE M",CIVIL ENGINEER IV,WATER MGMNT,F,Salary,NaN,110064.0,NaN
4,"ABASCAL, REECE E",TRAFFIC CONTROL AIDE-HOURLY,OEMC,P,Hourly,20.0,NaN,19.86

We see from looking at the `head` function that there is quite a bit of missing data. Let's examine how much missing data is in each column. Produce this output in the cell below

In [20]:
salaries.isnull().sum()

Name                     0
Job Titles               0
Department               0
Full or Part-Time        0
Salary or Hourly         0
Typical Hours        25161
Annual Salary         8022
Hourly Rate          25161
dtype: int64

Let's also look at the count of hourly vs. salaried employees. Write the code in the cell below

In [21]:
hourly_salaried = salaries['Salary or Hourly'].value_counts()
hourly_salaried

Salary or Hourly
Salary    25161
Hourly     8022
Name: count, dtype: int64

What this information indicates is that the table contains information about two types of employees - salaried and hourly. Some columns apply only to one type of employee while other columns only apply to another kind. This is why there are so many missing values. Therefore, we will not do anything to handle the missing values.

There are different departments in the city. List all departments and the count of employees in each department.

In [22]:
departments = salaries['Department'].value_counts()
departments

Department
POLICE                   13414
FIRE                      4641
STREETS & SAN             2198
OEMC                      2102
WATER MGMNT               1879
AVIATION                  1629
TRANSPORTN                1140
PUBLIC LIBRARY            1015
GENERAL SERVICES           980
FAMILY & SUPPORT           615
FINANCE                    560
HEALTH                     488
CITY COUNCIL               411
LAW                        407
BUILDINGS                  269
COMMUNITY DEVELOPMENT      207
BUSINESS AFFAIRS           171
COPA                       116
BOARD OF ELECTION          107
DoIT                        99
PROCUREMENT                 92
INSPECTOR GEN               87
MAYOR'S OFFICE              85
CITY CLERK                  84
ANIMAL CONTRL               81
HUMAN RESOURCES             79
CULTURAL AFFAIRS            65
BUDGET & MGMT               46
ADMIN HEARNG                39
DISABILITIES                28
TREASURER                   22
HUMAN RELATIONS             16
BOARD OF ETHICS              8
POLICE BOARD                 2
LICENSE APPL COMM            1
Name: count, dtype: int64

# Challenge 2 - Hypothesis Tests

In this section of the lab, we will test whether the hourly wage of all hourly workers is significantly different from $30/hr. Import the correct one sample test function from scipy and perform the hypothesis test for a 95% two sided confidence interval.

In [24]:
import scipy.stats as st

In [25]:
nan_check = salaries['Salary or Hourly'].isna()
nan_check

0        False
1        False
2        False
3        False
4        False
         ...
33178    False
33179    False
33180    False
33181    False
33182    False
Name: Salary or Hourly, Length: 33183, dtype: bool

In [26]:
nan_count = salaries['Salary or Hourly'].isna().sum()
nan_count

0

In [27]:
sample = salaries['Salary or Hourly'].sample(30)
sample

18351    Salary
23190    Salary
16779    Salary
22162    Salary
31481    Hourly
18251    Hourly
20939    Hourly
31845    Salary
5042     Hourly
2922     Salary
1745     Hourly
11702    Salary
10936    Hourly
6990     Hourly
29435    Hourly
21644    Salary
23837    Salary
17569    Salary
18665    Salary
29672    Salary
8103     Salary
21262    Salary
16007    Salary
12108    Salary
17600    Salary
7192     Salary
9479     Salary
23662    Hourly
20954    Salary
6645     Hourly
Name: Salary or Hourly, dtype: object

In [28]:
sample = salaries[salaries['Salary or Hourly']=='Hourly']['Hourly Rate'].sample(30)
sample

18589    37.56
25514    35.60
8151     46.35
30511    45.07
6877     44.88
19587    40.20
14451    21.30
28632    21.98
20267    17.42
33147    35.60
12773    26.32
21954    48.85
5041     33.56
9553     36.21
32310    32.04
12164    49.10
23099    41.10
6126     40.20
32611    19.86
19041    35.60
20828    13.15
14240    19.86
18651    13.00
30849    18.52
27052    40.20
26260    32.04
12413     2.65
16256    36.21
11699    36.21
31900    35.60
Name: Hourly Rate, dtype: float64

In [29]:
round(sample.mean(), 2)

31.87

In [30]:
st.ttest_1samp(sample, 30)

TtestResult(statistic=0.8683005421710747, pvalue=0.3923589686705927, df=29)

In [31]:
pvalue=0.2051633758338194

In [32]:
# Confidence interval is 0.05 and pvalue is bigger then condifence interval. We can say that hourly wages do not significantly different from 30 dollars per hour.

We are also curious about salaries in the police force. The chief of police in Chicago claimed in a press briefing that salaries this year are higher than last year's mean of $86000/year a year for all salaried employees. Test this one sided hypothesis using a 95% confidence interval.

Hint: A one tailed test has a p-value that is half of the two tailed p-value. If our hypothesis is greater than, then to reject, the test statistic must also be positive.

In [33]:
police = salaries [salaries['Department'] == 'POLICE'].sample(30) 
police

,Name,Job Titles,Department,Full or Part-Time,Salary or Hourly,Typical Hours,Annual Salary,Hourly Rate
10135,"GAUSE, CLAUZELL",POLICE OFFICER,POLICE,F,Salary,NaN,87006.0,NaN
17499,"LYNCH, GARY M",POLICE OFFICER,POLICE,F,Salary,NaN,48078.0,NaN
340,"ALBIZUREZ, HECTOR F",POLICE OFFICER,POLICE,F,Salary,NaN,72510.0,NaN
29298,"TEPER, ALICJA",POLICE OFFICER,POLICE,F,Salary,NaN,84054.0,NaN
15167,"KEMPER, JANET C",SERGEANT,POLICE,F,Salary,NaN,111474.0,NaN
3798,"CALDERON, SERGIO",POLICE OFFICER,POLICE,F,Salary,NaN,84054.0,NaN
12833,"HOBAN, JULIE E",POLICE OFFICER,POLICE,F,Salary,NaN,96060.0,NaN
23508,"POPPISH, EDWARD J",POLICE OFFICER,POLICE,F,Salary,NaN,90024.0,NaN
2947,"BRIDGEMAN, LAWANDA",POLICE OFFICER,POLICE,F,Salary,NaN,93354.0,NaN
6664,"DAVIS, NICHOLAS M",POLICE OFFICER,POLICE,F,Salary,NaN,48078.0,NaN
2091,"BERRY, THERESA S",POLICE OFFICER,POLICE,F,Salary,NaN,87006.0,NaN
13308,"HUGHES, GARY G",POLICE OFFICER,POLICE,F,Salary,NaN,90024.0,NaN
7471,"DONAHUE, PATRICK E",SERGEANT,POLICE,F,Salary,NaN,107988.0,NaN
24316,"REDDITTE, RONALD A",SENIOR DATA ENTRY OPERATOR,POLICE,F,Salary,NaN,63876.0,NaN
23084,"PETIT, PIERRE R",POLICE OFFICER,POLICE,F,Salary,NaN,90024.0,NaN
26994,"SHAAR, KHALED W",POLICE OFFICER,POLICE,F,Salary,NaN,90024.0,NaN
23863,"PYE, CHARLES D",POLICE OFFICER,POLICE,F,Salary,NaN,90024.0,NaN
11288,"GRUBA, KYLE",POLICE OFFICER,POLICE,F,Salary,NaN,84054.0,NaN
30807,"VILLANUEVA, ENRIQUE",POLICE OFFICER,POLICE,F,Salary,NaN,48078.0,NaN
473,"ALLEN, KEITH A",POLICE OFFICER (ASSIGNED AS DETECTIVE),POLICE,F,Salary,NaN,103932.0,NaN
16201,"LANCASTER, CRAIG D",POLICE OFFICER,POLICE,F,Salary,NaN,93354.0,NaN
6493,"DARCY, MARK P",POLICE OFFICER,POLICE,F,Salary,NaN,90024.0,NaN
24626,"RIALMO, ROBERT",POLICE OFFICER,POLICE,F,Salary,NaN,84054.0,NaN
17861,"MANGAN, ROBERT J",POLICE OFFICER,POLICE,F,Salary,NaN,96060.0,NaN
8509,"FABIAN JR, ELMER A",SERGEANT,POLICE,F,Salary,NaN,104628.0,NaN
20872,"NAKOS, KONSTANTINOS",POLICE OFFICER,POLICE,F,Salary,NaN,80016.0,NaN
100,"ACOSTA, MARIA DE LOS ANGELES",FREEDOM OF INFORMATION ACT OFFICER,POLICE,F,Salary,NaN,50676.0,NaN
25511,"ROMAN, MARK A",POLICE OFFICER,POLICE,F,Salary,NaN,48078.0,NaN
681,"AMEZAGA, LAURA A",POLICE OFFICER,POLICE,F,Salary,NaN,90024.0,NaN
5820,"CORVERA, ANGELICA A",POLICE OFFICER,POLICE,F,Salary,NaN,72510.0,NaN

In [34]:
null_hypothesis_mean = 86000

In [35]:
nan_check = salaries['Annual Salary'].isna()
nan_check

0        False
1        False
2        False
3        False
4         True
         ...
33178    False
33179    False
33180    False
33181    False
33182    False
Name: Annual Salary, Length: 33183, dtype: bool

In [36]:
nan_count = salaries['Annual Salary'].isna().sum()
nan_count

8022

In [37]:
non_nan = salaries.dropna(subset = ['Annual Salary'])
non_nan

,Name,Job Titles,Department,Full or Part-Time,Salary or Hourly,Typical Hours,Annual Salary,Hourly Rate
0,"AARON, JEFFERY M",SERGEANT,POLICE,F,Salary,NaN,101442.0,NaN
1,"AARON, KARINA",POLICE OFFICER (ASSIGNED AS DETECTIVE),POLICE,F,Salary,NaN,94122.0,NaN
2,"AARON, KIMBERLEI R",CHIEF CONTRACT EXPEDITER,GENERAL SERVICES,F,Salary,NaN,101592.0,NaN
3,"ABAD JR, VICENTE M",CIVIL ENGINEER IV,WATER MGMNT,F,Salary,NaN,110064.0,NaN
5,"ABBASI, CHRISTOPHER",STAFF ASST TO THE ALDERMAN,CITY COUNCIL,F,Salary,NaN,50436.0,NaN
...,...,...,...,...,...,...,...,...
33178,"ZYLINSKA, KATARZYNA",POLICE OFFICER,POLICE,F,Salary,NaN,72510.0,NaN
33179,"ZYMANTAS, LAURA C",POLICE OFFICER,POLICE,F,Salary,NaN,48078.0,NaN
33180,"ZYMANTAS, MARK E",POLICE OFFICER,POLICE,F,Salary,NaN,90024.0,NaN
33181,"ZYRKOWSKI, CARLO E",POLICE OFFICER,POLICE,F,Salary,NaN,93354.0,NaN
33182,"ZYSKOWSKI, DARIUSZ",CHIEF DATA BASE ANALYST,DoIT,F,Salary,NaN,115932.0,NaN

In [38]:
st.ttest_1samp(non_nan['Annual Salary'], 86000 , alternative = 'greater')

TtestResult(statistic=5.932870515690814, pvalue=1.507879259958193e-09, df=25160)

In [39]:
pvalue=1.507879259958193e-09

In [40]:
alpha = 0.05
pvalue > alpha
# we can reject hypothesis. There is no evidence that salaries in police department are higher then 86000 dollars.

False

Using the `crosstab` function, find the department that has the most hourly workers.

In [46]:
hourly = crosstab = pd.crosstab(salaries['Department'], salaries['Salary or Hourly'])['Hourly']
hourly

Department
ADMIN HEARNG                0
ANIMAL CONTRL              19
AVIATION                 1082
BOARD OF ELECTION           0
BOARD OF ETHICS             0
BUDGET & MGMT               2
BUILDINGS                   0
BUSINESS AFFAIRS            7
CITY CLERK                  0
CITY COUNCIL               64
COMMUNITY DEVELOPMENT       4
COPA                        0
CULTURAL AFFAIRS            7
DISABILITIES                0
DoIT                        0
FAMILY & SUPPORT          287
FINANCE                    44
FIRE                        2
GENERAL SERVICES          765
HEALTH                      3
HUMAN RELATIONS             0
HUMAN RESOURCES             4
INSPECTOR GEN               0
LAW                        40
LICENSE APPL COMM           0
MAYOR'S OFFICE              8
OEMC                     1273
POLICE                     10
POLICE BOARD                0
PROCUREMENT                 2
PUBLIC LIBRARY            299
STREETS & SAN            1862
TRANSPORTN                725
TREASURER                   0
WATER MGMNT              1513
Name: Hourly, dtype: int64

In [47]:
hourly.max()
# max hourly departmnet is STREETS & SAN

1862

The workers from the department with the most hourly workers have complained that their hourly wage is less than $35/hour. Using a one sample t-test, test this one-sided hypothesis at the 95% confidence level.

In [51]:
streets_and_san = salaries[salaries['Department'] == 'STREETS & SAN']
streets_and_san

,Name,Job Titles,Department,Full or Part-Time,Salary or Hourly,Typical Hours,Annual Salary,Hourly Rate
7,"ABBATE, JOSEPH L",POOL MOTOR TRUCK DRIVER,STREETS & SAN,F,Hourly,40.0,NaN,35.60
21,"ABDUL-SHAKUR, TAHIR",GENERAL LABORER - DSS,STREETS & SAN,F,Hourly,40.0,NaN,21.43
24,"ABERCROMBIE, TIMOTHY",MOTOR TRUCK DRIVER,STREETS & SAN,F,Hourly,40.0,NaN,35.60
36,"ABRAMS, DANIELLE T",SANITATION LABORER,STREETS & SAN,F,Hourly,40.0,NaN,36.21
39,"ABRAMS, SAMUEL A",POOL MOTOR TRUCK DRIVER,STREETS & SAN,F,Hourly,40.0,NaN,35.60
...,...,...,...,...,...,...,...,...
33107,"ZIZUMBO, LUIS",MOTOR TRUCK DRIVER,STREETS & SAN,F,Hourly,40.0,NaN,35.60
33147,"ZUMMO, ROBERT J",MOTOR TRUCK DRIVER,STREETS & SAN,F,Hourly,40.0,NaN,35.60
33149,"ZUNICH, JONATHAN G",SANITATION LABORER,STREETS & SAN,F,Hourly,40.0,NaN,36.21
33156,"ZUNIGA, THOMAS",GENERAL LABORER - DSS,STREETS & SAN,F,Hourly,40.0,NaN,22.12
33162,"ZURAWSKI, MAC Z",REFUSE COLLECTION COORD,STREETS & SAN,F,Salary,NaN,76896.0,NaN

In [52]:
streets_and_san['Hourly Rate'].mean()

33.72837808807734

In [53]:

st.ttest_1samp(streets_and_san['Hourly Rate'], 35, alternative='less', nan_policy = 'omit')

TtestResult(statistic=-9.567447887848152, pvalue=1.6689265282353859e-21, df=1861)

In [ ]:
# pvalue is close to 0 and we can reject null hypothesis. That means that hourly wages of workes are less then 35 dollars in hour.

# Challenge 3: To practice - Constructing Confidence Intervals

While testing our hypothesis is a great way to gather empirical evidence for accepting or rejecting the hypothesis, another way to gather evidence is by creating a confidence interval. A confidence interval gives us information about the true mean of the population. So for a 95% confidence interval, we are 95% sure that the mean of the population is within the confidence interval. 
).

To read more about confidence intervals, click [here](https://en.wikipedia.org/wiki/Confidence_interval).


In the cell below, we will construct a 95% confidence interval for the mean hourly wage of all hourly workers. 

The confidence interval is computed in SciPy using the `t.interval` function. You can read more about this function [here](https://docs.scipy.org/doc/scipy-0.14.0/reference/generated/scipy.stats.t.html).

To compute the confidence interval of the hourly wage, use the 0.95 for the confidence level, number of rows - 1 for degrees of freedom, the mean of the sample for the location parameter and the standard error for the scale. The standard error can be computed using [this](https://docs.scipy.org/doc/scipy/reference/generated/scipy.stats.sem.html) function in SciPy.

In [59]:
df = salaries[salaries['Salary or Hourly'] == 'Hourly']
df

,Name,Job Titles,Department,Full or Part-Time,Salary or Hourly,Typical Hours,Annual Salary,Hourly Rate
4,"ABASCAL, REECE E",TRAFFIC CONTROL AIDE-HOURLY,OEMC,P,Hourly,20.0,NaN,19.86
6,"ABBATACOLA, ROBERT J",ELECTRICAL MECHANIC,AVIATION,F,Hourly,40.0,NaN,46.10
7,"ABBATE, JOSEPH L",POOL MOTOR TRUCK DRIVER,STREETS & SAN,F,Hourly,40.0,NaN,35.60
10,"ABBOTT, BETTY L",FOSTER GRANDPARENT,FAMILY & SUPPORT,P,Hourly,20.0,NaN,2.65
18,"ABDULLAH, LAKENYA N",CROSSING GUARD,OEMC,P,Hourly,20.0,NaN,17.68
...,...,...,...,...,...,...,...,...
33164,"ZUREK, FRANCIS",ELECTRICAL MECHANIC,OEMC,F,Hourly,40.0,NaN,46.10
33168,"ZWARYCZ MANN, IRENE A",CROSSING GUARD,OEMC,P,Hourly,20.0,NaN,17.68
33169,"ZWARYCZ, THOMAS J",POOL MOTOR TRUCK DRIVER,WATER MGMNT,F,Hourly,40.0,NaN,35.60
33174,"ZYGADLO, JOHN P",MACHINIST (AUTOMOTIVE),GENERAL SERVICES,F,Hourly,40.0,NaN,46.35
33175,"ZYGADLO, MICHAEL J",FRM OF MACHINISTS - AUTOMOTIVE,GENERAL SERVICES,F,Hourly,40.0,NaN,48.85

In [72]:
df_cleaned = salaries.dropna(subset=['Hourly Rate'])
df_cleaned

,Name,Job Titles,Department,Full or Part-Time,Salary or Hourly,Typical Hours,Annual Salary,Hourly Rate
4,"ABASCAL, REECE E",TRAFFIC CONTROL AIDE-HOURLY,OEMC,P,Hourly,20.0,NaN,19.86
6,"ABBATACOLA, ROBERT J",ELECTRICAL MECHANIC,AVIATION,F,Hourly,40.0,NaN,46.10
7,"ABBATE, JOSEPH L",POOL MOTOR TRUCK DRIVER,STREETS & SAN,F,Hourly,40.0,NaN,35.60
10,"ABBOTT, BETTY L",FOSTER GRANDPARENT,FAMILY & SUPPORT,P,Hourly,20.0,NaN,2.65
18,"ABDULLAH, LAKENYA N",CROSSING GUARD,OEMC,P,Hourly,20.0,NaN,17.68
...,...,...,...,...,...,...,...,...
33164,"ZUREK, FRANCIS",ELECTRICAL MECHANIC,OEMC,F,Hourly,40.0,NaN,46.10
33168,"ZWARYCZ MANN, IRENE A",CROSSING GUARD,OEMC,P,Hourly,20.0,NaN,17.68
33169,"ZWARYCZ, THOMAS J",POOL MOTOR TRUCK DRIVER,WATER MGMNT,F,Hourly,40.0,NaN,35.60
33174,"ZYGADLO, JOHN P",MACHINIST (AUTOMOTIVE),GENERAL SERVICES,F,Hourly,40.0,NaN,46.35
33175,"ZYGADLO, MICHAEL J",FRM OF MACHINISTS - AUTOMOTIVE,GENERAL SERVICES,F,Hourly,40.0,NaN,48.85

In [73]:
mean_hourly = df_cleaned['Hourly Rate'].mean()
mean_hourly

32.78855771628024

In [74]:
standard_error = st.sem(df_cleaned['Hourly Rate'])
standard_error

0.1352368565101596

In [76]:
degrees_of_freedom = len(df_cleaned['Hourly Rate']) - 1
degrees_of_freedom

8021

In [78]:
confidence_interval = st.t.interval(0.95, df=degrees_of_freedom, loc=mean_houry, scale=standard_error)

In [79]:
confidence_interval

(32.52345834488424, 33.05365708767622)

Now construct the 95% confidence interval for all salaried employeed in the police in the cell below.

In [81]:
mean_hourly2 = police['Annual Salary'].mean()
mean_hourly2

82638.2

In [84]:
standard_error2 = st.sem(police['Annual Salary'])
standard_error2

3354.9297395387252

In [85]:
degrees_of_freedom2 = len(police['Annual Salary']) - 1
degrees_of_freedom2

29

In [87]:
confidence_interval2 = st.t.interval(0.95, df=degrees_of_freedom, loc=mean_hourly2, scale=standard_error)
confidence_interval2

(75776.59824942285, 89499.80175057714)

# Bonus Challenge - Hypothesis Tests of Proportions

Another type of one sample test is a hypothesis test of proportions. In this test, we examine whether the proportion of a group in our sample is significantly different than a fraction. 

You can read more about one sample proportion tests [here](http://sphweb.bumc.bu.edu/otlt/MPH-Modules/BS/SAS/SAS6-CategoricalData/SAS6-CategoricalData2.html).

In the cell below, use the `proportions_ztest` function from `statsmodels` to perform a hypothesis test that will determine whether the number of hourly workers in the City of Chicago is significantly different from 25% at the 95% confidence level.

In [ ]:
# Your code here: